# CLI tools
brew "git"
brew "bat"
# Terminal based "The Matrix" like implementation
brew "cmatrix"
brew "figlet"
brew "lazydocker"
brew "neovim"
# pinentry is the secure UI that GPG uses to ask for your passphrase, since GPG itself has no way to prompt you directly.
brew "pinentry-mac"
brew "ripgrep"
brew "speedtest-cli"
brew "tree"
brew "yt-dlp"

# GUI apps
cask "alfred"
cask "nikitabobko/tap/aerospace"
cask "anki"
cask "brave-browser"
cask "docker-desktop"
cask "firefox"
cask "flameshot"
cask "ghostty"
cask "maccy"
cask "motu-m-series"
cask "obs"
cask "protonvpn"
cask "pycharm"
cask "scroll-reverser"
cask "shifty"
cask "spotify"
cask "transcribe"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zoom"

# yazi + dependencies
# Yazi is a Terminal file manager
# https://yazi-rs.github.io/docs/installation/#homebrew
brew "yazi"
brew "ffmpeg-full"
brew "imagemagick-full"
brew "sevenzip"
brew "jq"
brew "poppler"
brew "fd"
brew "fzf"
brew "zoxide"
brew "resvg"
cask "font-symbols-only-nerd-font"

# Water Direct specifics
cask "slack"
cask "clickup"
