# CLI tools
brew "bat"
brew "figlet"
brew "neovim"
brew "ripgrep"
brew "speedtest-cli"
brew "tree"
brew "yt-dlp"

# GUI apps
cask "alfred"
cask "anki"
cask "brave-browser"
cask "docker-desktop"
cask "firefox"
cask "flameshot"
cask "ghostty"
cask "iterm2"
cask "maccy"
cask "motu-m-series"
cask "obs"
cask "protonvpn"
cask "pycharm-ce"
cask "rectangle"
cask "scroll-reverser"
cask "shifty"
cask "spotify"
cask "transcribe"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zoom"
