# CLI tools
brew "bat"
brew "figlet"
brew "neovim"
brew "ripgrep"
brew "speedtest-cli"
brew "tree"
brew "yt-dlp"

# GUI apps
cask "brave-browser"
cask "firefox"
cask "flameshot"
cask "maccy"
cask "motu-m-series"
cask "protonvpn"
cask "pycharm-ce"
cask "rectangle"
cask "scroll-reverser"
cask "spotify"
cask "vlc"
cask "whatsapp"
cask "zed"
